[
  {
    "content": "Q: so what are other ways to collateralize alone.\nA: So they're going to look at every all the other assets. So cash in your 401 k cash in your brokerage account cashed in your savings account. They're gonna look at, you know, if you have vehicles, things that can be easily, you know, sold to recoup losses. So not just houses, but anything else that you have of value that you. You list out as as your assets. That's that's what they would be using",
    "source_id": "1078",
    "similarity": 0.621317215922387,
    "result_date": "2024-03-18T00:00:00+00:00",
    "file_identifier": "VTT - Acquisition Ace Academy - 20240318",
    "source_category": "qa_pair"
  },
  {
    "content": "Q: About the collateral does the cash flow from the business count towards the collateral requirements. If we, if I, if we have net positive cash, flow beyond after paying the monthly payment back. The cash flow. I'm sorry the the collateral amount have to match the loan amount.\nA: No, it doesn't. It would be Ca cash on collateral are done separately that would be but because collateral tends to like. If there's real estate that helps always annoy. If the business includes real estate that is always collateral, but then they'll be looking at at various assets of the borrowers. As a as a rule. it could be liquid assets, not just real estate. It's our preference. It's not that's the joy. Then we're looking at other factors about the apple and each bank is different about that. And it's basically the the there is. That's where the debate is, cause that's the risk reward thing. So there is. Are we going to be. It's about having the comfort level when there is an app. It's getting underwriting comfortable with an air ball, and how we can mitigate it. So the answer is, yes, we it it, you know we can do air balls within reason. But then there is a whole host of you know we we've got a figure out how to mitigate that that risk. Debt covers. So debt service coverage basically is cash flow, the business. Now, cash flow. I'm saying the cash flow of the business right? So where the debate always is not the ebitda of of the business. Right? It's the other. Add backs that we, as the bank, will accept, and banks tend to be rather conservative, to do what they will and won't do right, and they gotta be able to be documented. So it's 1 off expenses and documented expenses. So most of this is like. you know, the sellers, you know, are taking salaries. They're child is in the business. Their nephews in the business. Those who are leaving the business when you acquire it right. Those sort of things are usually pretty easy to document with W. Twos and and 10 ninety-nines, and we will need that will require that information. It's the when you're trying to put the dry cleaning. And I have actually seen that, by the way. So that's not a joke. I had $250 dry cleaning, which was a running joke with the banker at the time doing that. Those are the things that will be that we gotta, you know, you know. So what you'll see is like some businesses, especially in this era. There's a lot of personal expenses. Things like fuel are very, very hard to document and tend to be next. And that's where there's some debate and add backs. Now am I think, you know, is dog going to be aggressive and understanding? We're probably going to be pretty middle of the road, and it's I've got. You know they've got to remember. It's I've got to get underwriting pretty comfortable if if I can get it documented in doing that. then I can. You know, that's that helps enormously. And so what would you know? Basically. the coverage ratio is the cash flow divided by annual debt service. Right? So. And what we're looking for. A minimum is usually about a 1.2 5 1.3, depending on the industry. Hospitality, like hotels and restaurants, tend to be a little higher. because they are perceived with as having more risk. So usually 1.3 1.3 5. Here's the reality guys, right? If you are taking a business over, and the majority of the debt you know of the coverage is going to pay the debt service, and not much is going to you. It may not be. That is this a business you guys really want to take? Because the whole point. Why, you're acquiring a business is to. you know, is to be, you know, for it to be profitable, and for you to be growing it And so, when you know the coverage ratio is pretty thin. That means you're for going profit from it. And you know, and so I would. Always. The question I would ask is. is that does, you know? Does this make sense for you? Right? And part of it? Why you should bring someone like me in early is that I can sort of say, Okay, here's where it is. Here's where we're at. you know, and you can go. You know, this business, you know, makes sense. This business doesn't make sense. And the earlier we're in. you know the better. And I think smoother, because buying a business is is a process right? And you you know, you're likely to have to kiss a few frogs in the process, so the better. You know, the earlier you come in with someone like me. who all, with the additional experience to have, is, I think I could help make it hopefully a little smoother and and less bumpy.",
    "source_id": "1661",
    "similarity": 0.600837582424665,
    "result_date": "2025-05-01T12:36:57.328715+00:00",
    "file_identifier": "VTT - Offers & Structures - 20250501",
    "source_category": "qa_pair"
  },
  {
    "content": " account that could be used as collateral to pay back the SBA there's no free lunch when it comes to business Acquisitions if you are getting money that's backed by the federal government it's amazing you're getting a crazy amount of Leverage to be able to do these deals but if your deal goes south then you're on the hook and that's something that you need to make sure that you're okay with and that you understand the risk for thankfully the success rate of SBA Loans over a 5-year period is 95 plus per. so we're talking about 5% of the deals that end up going bad and where the bank is having the conversation with the buyer but you have to make sure you're going to every deal with the knowledge that that is a possibility however remote it is and making sure you're okay with the collateral that's going to be used to pay back the bank so the first lender that I actually spent a lot of time with is live o bank now live oak is the largest SBA lender in the entire country they give out more loans and more volume than any other bank that's out there so they have a lot of data across all different industries that they fund which is great because I'm able to ask my lender about certain industries that I'm looking to invest in and what has been the data from it he'll be able to say the bank loves that industry because there's an amazing payback history and there's been very little defaults or hey that industry is getting more and more defaults we're getting a little bit more shy about going in lending on a deal in that industry so make sure you're using your lender not just as hey will you fund this deal but that lender only gets paid on the deal if it goes through so make sure you're using them to look at the deal to analyze the deal send the numbers when you get them in the confidential information memorandum the Sim that you get from the sellers broker ask them to tell you how much they're",
    "source_id": "1959",
    "similarity": 0.511721074581146,
    "result_date": "2024-10-22T11:47:44.000-07:00",
    "file_identifier": "https://www.youtube.com/watch?v=Xf4XDmk4yvc",
    "source_category": "chunk"
  },
  {
    "content": " over a\n certain term period. So like the deal\n that we talked about earlier. So, a\n seven-year term on a 5% annual rate and\n you're going to get paid monthly back to\n the seller. Okay? So, now that's\n predictable income coming to the seller\n every single month and they know exactly\n what's coming into them. Now, many times\n the seller is going to want a personal\n guarantee. Now, this is where you can\n have some negotiation happen. depending\n on the deal and depending on the size of\n the deal, the seller might not care\n about you having a personal guarantee or\n they just are not a big stickler on it\n because the business has a lot of\n collateral in it and they are fine with\n that being the collateral for the the\n note that they're taking on. Okay? So,\n if you were to default and not pay them,\n they take the business back over, they\n get all the equipment, they get all the\n things that are worth a lot of money and\n they're fine with that. So, that can\n happen in some deals. Other deals, the\n seller is taking on a lot of risk and\n they say, \"No, you're going to have to\n take on a personal guarantee just like\n you would for an SBA loan.\" And you can\n negotiate that back and forth. It's\n between you and the seller. No one else\n is involved. So instead of it being for\n the full purchase price of the loan,\n maybe you get the guarantee down to half\n the loan or maybe even less than half\n the loan. And then there's other times\n where the seller doesn't even ask for\n it. The seller believes in their\n business. They know exactly what it\n takes to make that business successful.\n They think that you have the capability\n to do it and that's not even something\n that",
    "source_id": "1583",
    "similarity": 0.495649084319147,
    "result_date": "2025-04-28T17:00:53.245-07:00",
    "file_identifier": "https://docs.google.com/document/d/1GZEAUil1JZWXwZUqM76LHT-fu694-Y9s",
    "source_category": "chunk"
  },
  {
    "content": " they bring up. Now, I would\n recommend you do not bring up the topic\n of a personal guarantee because it's in\n your best interest to limit your\n downside risk not to have one. But if\n they were to bring it up, remember that\n there's two to tango here in this\n negotiation and come from the\n perspective of I want you involved. I'm\n willing to take on maybe a little\n personal guarantee, but not for the full\n amount. We can collateralize the rest of\n this with the assets of the business and\n make sure that you are being your best\n advocate. One of the things you can do,\n especially when you do a seller finance\n deal, is you can do performance-based\n payments for the seller, right? So,\n these are kind of earnouts. When you do\n an SBA s..."
  }
]