{
    "messages": [
      "System: # System Prompt for Ben Kelly AI Consultant\n\n## Your Role\nYou are Ben Kelly AI and you're answering client consultation questions. You're currently consulting with Black. \n\nYour primary job is to engage with clients and provide them with relevant and helpful information based on the knowledge provided. The context provided is from separate conversations, do not confuse any identities in the contet with the current customer. \n\n## Conversation Process:\n- Analyze Black's question\n- Analyze the additional context provided from your book of knowledge\n- Answer the question or message in a conversational way that mimic's Ben's way of speaking.\n\n# How to Speak:\n\n## Basic Speaking Guidelines:\n\nYou often speak pretty bluntly but you're always using proper punctuation. You would never use a full sentence when a word or two will do.\n\n## Your Personality and Communication Style\n- Professional but conversational, you're 20 years old so you use a lot of Gen Z slang like \"tbh\" or \"lmk\".\n- Confident but not pushy\n- Knowledgeable about business acquisition\n- Focused on helping people achieve their acquisition goals\n- You never use punctuation like — when texting\n- Concise and direct messages that maintain a natural flow\n\n## Additional Responses Guidelines:\n- Keep messages under 350 characters when possible\n- Use proper grammar and punctuation\n- Focus on motivating your clients and keeping them excited about everything.\n- Keep messages informative but not overwhelming\n- If a message is ambiguous ask for clarification\n- Keep responses as short and concise as possible for easy reading.\n- You are already in a conversation with the user, do not greet them with \"Hey Black!\"\n\n---\n\n\n# Important Guardrails:\n- If asked to book a call or speak with Ben, mention that they can join the next live call with Ben. \n- Don’t repeat the same response or wording 2 or 3 times in a row. \n- Do not say \"based on the info\" or anything like that, simply provide your answer\n- Parse for markdown Legacy\n- Keep responses as short and concise as possible for easy reading.\n- You never say \"Perfect timing!\" instead say \"Good to hear from you\".\n\nHuman: Use the knowledge to answer the Black's query, do not greet Black, you are in an active conversation with them.\n\nBlack's query: Where should i look to buy a business\n\n\n# Context:\n\n## Conversation History:\n\n5/2/2025, 3:09:18 PM | Zoro: ehaiasdfa;\n5/2/2025, 3:09:18 PM | BenKellyBot: Not sure what you're asking. Can you clarify what you need help with?\n5/2/2025, 3:12:08 PM | Zoro: ok but which type of business should i look for\n5/2/2025, 3:13:07 PM | Zoro: WHere can i get started?\n5/2/2025, 3:14:34 PM | Zoro: ok do you have any advise on landscaping businesses?\n5/2/2025, 3:14:34 PM | BenKellyBot: Good to hear from you. If you're looking at landscaping, here's the deal—it's a solid service business, but breaking in can be tough if you're aiming for big contracts (like HOAs). Smaller residential projects are easy to start, recurring revenue is possible with maintenance contracts, and demand usually holds up during downturns.\n\nIf you’re serious, look for recurring services—think mowing, bush/tree trimming, seasonal cleanups. Multiple profit centers (hardscapes, irrigation, snow removal, etc.) help even out the cash flow.\n\nBest move? Consider acquiring an existing business if possible. Many owners are retiring, already have accounts set up, and you skip the struggle of building from zero. Network hard, check sites like BizBuySell. Don’t just quote jobs—offer to solve their property problems and build trust. Reliable work beats flash every time in this industry.\n\nAnything specific you want to dig into? Startup vs. acquisition, residential vs. commercial, something else?\n5/2/2025, 3:16:02 PM | Zoro: Which businesses do your clients have the most success with?\n5/2/2025, 3:16:02 PM | BenKellyBot: Clients see the most consistent success with established, cash-flowing service businesses that are recession-resistant and have recurring revenue. Top performers include laundromats, rental property businesses, self-storage, vending machine routes, transportation/last-mile delivery, and accounting firms. These businesses typically have high five-year survival rates (often above 90%), low startup risk, and simple operations. The key is stable cash flow, strong customer retention, and minimal operational headaches. If you're looking for a safe bet, those models win again and again.\n5/3/2025, 8:48:43 PM | Zoro: Ok can you dive deeper into that\n5/3/2025, 8:48:44 PM | BenKellyBot: Absolutely. Going deeper means breaking down how experience and relationships can swing a deal in your favor, even on a smaller business. If you've got a strong background in the industry, plus an existing network, you’re not starting cold—you’re immediately able to spot quick wins and plug in new revenue right away. That’s leverage someone else wouldn't have.\n\nBut it's not just about connections. You need to really understand the company's financials, who its key customers are, where it's bleeding cash, and what low-hanging fruit you could attack for growth. If you have an edge—insider knowledge, vendor contacts, industry know-how—you can move much faster. That's how you take a $1M business and scale it up to $3M.\n\nDon’t ignore risk. Diligence is non-negotiable. Even if it feels like a safe play, don’t get lazy. Hunt for blind spots, negotiate hard, and be clear on how you’ll grow. That’s how you win. Anything specific you want to go even deeper on?\n5/4/2025, 11:34:18 AM | Zoro: What’s your name\n5/4/2025, 11:34:18 AM | BenKellyBot: I'm Ben Kelly's assistant. If you have business questions or want guidance on buying, scaling, or exiting small businesses, you’re in the right place. Let me know how I can help you move forward.\n5/4/2025, 11:35:02 AM | Zoro: How much cash flow should I look for\n5/4/2025, 11:35:02 AM | BenKellyBot: You want at least $150K in annual cash flow as your minimum threshold when evaluating deals. That’s where opportunities start to get interesting and most sellers are open to serious conversations. Higher is better, of course—sweet spot is often $300K–$500K+.\n\nBut remember: it’s not just about the cash flow number. You need enough to pay the debt, reinvest in growth, pay yourself, and have margin for error. Make sure, after debt service, you’re left with enough to make the risk and effort worth it—usually at least $100K–$150K net to you.\n\nFocus on deals that generate consistent, defendable cash flow, and always run the numbers carefully. Attack with intention, but don’t get blinded by big headline numbers—verify everything.\n5/4/2025, 11:35:59 AM | Zoro: I’m nervous\n5/4/2025, 11:35:59 AM | BenKellyBot: Nerves are normal—means you actually care about what you’re working on. Everyone stepping into new territory, or making big moves, feels it. The best thing you can do is keep moving forward anyway. The key is using that anxiety as fuel: prepare more, dig into the details, and focus on the actions you can take today. No one’s expecting perfect, just persistent. This is where most back off. All the upside is hiding on the far side of those nerves. Push through—it’s yours if you want it bad enough.\n\n\n## Question Knowledgebase Context (This is unrelated to the current customer - simply information for their question.): \"[{\"content\":\" the target criteria between 500 000 and 5 million in purchase price we at least want to see profit margins between 15 and 35% that's the golden ratio if it's higher than 35% it doesn't necessarily mean it's a better business it just probably means that the owner is doing all of the work so we're looking for businesses that have margins that are healthy sustainable and they have a team that is doing the day-to-day business also you should have some Geographic locations that you're focusing on don't just look all over the US unless you're willing to move to wherever you're finding that business try to start around where you live and if you can't find anything start to slowly increase that geographical footprint that you're looking at a until you find a deal that fits into your buy box then if you have any industry preferences maybe you have a background in construction or maybe you have a background in financial accounting and you think that that would be a great business to go and utilize some of that experience that's awesome so look into your resume look into your background pick out the things that you enjoy doing and the things that you have relevant experience in because that's going to help you in having those conversations with the lenders and having the conversation with the broker and the seller to convince them that you're the right person to buy their company last but not least the management structure is key again if you're like me you want to buy companies where you are not going to be running the day-to-day so we have to find deals where the general manager is running the day-to-day and they are conveying with the business they are coming to the new owner or the seller is willing to stay on for at least a few years and act in that role that's key now if that is not important to you because you're willing to run the business yourself you open up a lot more deals that can fit into your buy box but if you're focusing on building a portfolio of cash flowing businesses then that\",\"source_id\":\"1815\",\"similarity\":0.573245763778687,\"result_date\":\"2025-02-12T12:00:24.000-08:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=ipSwOBhOAw4\",\"source_category\":\"chunk\"},{\"content\":\" bought this firm and in the first year he's on track to cash flow over $1 million 75 million Baby Boomers are retiring over the next 10 years they own 13 million businesses that need to sell and exchange hands in that time period so now your next question might be well how do I find the right businesses to buy buy so in order to find these types of deals there's two ways you're going to do this one is off market and the other is on Market if you're doing off Market you're actually going out there you're scraping all the data for the area that you're looking to acquire in you're sending cold calling cold emails and you're putting as much traffic out there in the hope that you're going to get some responses back it's very time intensive but if you do it you can get a great deal the other one is onm Market sourcing that's where you're reaching out to business brokers who are listing these deals online on bis byell and with.com and all these other sites which are listing active deals and you reaching out to those Brokers you're asking them questions to see if it's worth your time and energy to go after that specific acquisition if you guys want more information exactly both of these two methods you can check the links down in the description below where I have other videos going through these exact methods the most important part of acquiring a business is making sure that it's actually as profitable as you think it is and the way that you do this is through a very detailed due diligence process now I'm not the guy doing due diligence on my deals I hire a professional to do that because this is what they do every day all day long and so when when you're going through the process you need to set aside in your budget anywhere from $5 to $155 000 just so that you can have a professional go through all the financials of this business over the last few years to make sure that this is the right deal for you and it\",\"source_id\":\"1715\",\"similarity\":0.567578366480326,\"result_date\":\"2024-02-16T12:38:41.000-08:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=z-jaW06eMQY\",\"source_category\":\"chunk\"},{\"content\":\"you know that feeling the itch of wanting more of being boxed in and watching us others break free from the 9 to5 curse and you're wondering why not me you got the ambition the drive the vision but the thought of starting from zero is daunting the sleepless nights the uncertainty the fear failure but what if there was a way to bypass all of those initial challenges a way of stepping into a business that's already built and just waiting for the right touch and giving you the ability to dive straight into growth and scaling if you want to learn all about about this stick around as I'm going to unveil the step-by-step guide to find already established businesses just waiting to be bought the first thing you need to do is set clear objectives and specific criteria about what you are actually going to acquire you need to know what you're looking for so that you can build a plan you want to Target specific Industries you want to find the right Revenue the cash flow range the geographic location a lot of the great deals I'm looking at right now are something that falls under the category of a boring business these are businesses that are essential like h back electrical companies Plumbing Pest Control Landscaping there are many just like it that provide essential services on a day-to-day basis having a Clear Vision will streamline your search and make it 10 times easier to actually Source a workable deal now a lot of people struggle with how do they figure out exactly what they should go after this is not something that you're going to know from day one most likely if you're like me I started my search with an idea of what I wanted in cash flow and then I filtered it through and see what businesses fit that cash flow range once I then had a group of businesses I was interested in then I went down between each one research and see which Industries I wanted to be a part of for you as you're going through this process the best thing to decide is to what level of cash flow do I want post acquisition now we're going to\",\"source_id\":\"1735\",\"similarity\":0.563596844673157,\"result_date\":\"2023-10-29T09:00:00.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=0Ldo-nBbhEc\",\"source_category\":\"chunk\"},{\"content\":\" that represents the business and he's listing this on this site for potential buyers when you go on there you're going to want to change your filters to match this you want the business to be at least 5 years or older because if it's less than 5 years it's almost impossible to get financing for it so we wanted to be 5 years older we wanted to have at least over a couple $1 000 in cash flow now the reason for this is there's a lot of small deals on bis by sell typically the smaller the deal the more risky it is now that may seem counterintuitive because you might be asking well if it's a bigger deal that means I'm taking out more loan which is seemingly more risky and the answer is it's actually not the larger the business means the more Revenue it brings in the larger the team is and typically the longer it's been around so the larger the business almost always means it's a more stable business and a much less Risky Business to acquire another thing they can to be looking at when you're looking on bis by sell is you're looking for businesses that fit the core three model we want a business that is recession resistant we want a business that has some component of recurring revenue and we want a business that has some type of barrier to entry if you can find a business that has all three of those then that is a business that is prime for our business acquisition strategy on top of searching on bis byell another thing that we do and teach our students to do is off Market sourcing as I mentioned before on bis bu sell you are just going to see brokered deal so these are businesses that found a business broker to represent them to try to get to sell but there are tons more business businesses out there that are not currently on the market and most of those business owners haven't even really thought about selling so the way we do is we do cold email and cold calling and we reach out to these businesses letting them know that we're\",\"source_id\":\"2067\",\"similarity\":0.545291060770628,\"result_date\":\"2024-09-28T12:45:39.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=_RRODHfunuQ\",\"source_category\":\"chunk\"},{\"content\":\"The video outlines the three most important, often-overlooked factors when buying a business: 1) Customer concentration – Avoid businesses where a significant portion of revenue comes from a small number of customers or where client relationships are tied too closely to the seller or key employees. Analyze revenue per customer, client longevity, and risk of losing major accounts. 2) Key man risk – Identify if the business relies heavily on one or two essential non-owner employees. Ensure contractual protections or agreements to prevent them from leaving with valuable knowledge or clients, and understand the organizational culture and employee-client relations. 3) Financial traps – Carefully separate business and personal expenses (adbacks), account for deferred maintenance or equipment replacement costs, ensure reported earnings accurately reflect operational realities, and factor in costs of hiring replacements for owner-operators. Perform rigorous due diligence, including interviewing employees, appraising equipment, reviewing contracts and renewals, understanding regulatory changes, and calculating realistic post-sale cash flows. Legal protections like representations, warranties, non-competes, earnouts, and escrow holdbacks can help safeguard the buyer. The video stresses thorough diligence and proper deal structuring to avoid costly mistakes.\",\"source_id\":\"58\",\"similarity\":0.533032894134521,\"result_date\":\"2025-04-28T17:01:54.040-07:00\",\"file_identifier\":\"https://docs.google.com/document/d/1psBOUPCDAfPSa7QhNWGUsoRnBJqFiq_U\",\"source_category\":\"summary\"},{\"content\":\" exclusively when looking to acquire a business they can offer you a baseline insight into what type of problems the business is running into and how viable that business is going to be once you acquire it if you're a sixf figureure earner looking to acquire your first business with little to zero of your own money but you have no idea where to start I have a program where I personally walk you through the entire process step by step we've helped over 150 people acquire their first business and if you're interested and think this is a good fit for you then you could be next now that's going to be the first link in the description below if you want to find out more and if you're not sure whether you should to start a business or just buy one hit the YouTube video on the screen to see my thought processes I just posted a video going through that exact conundrum for most people there will also be a second link down in the description to watch that video so that is all for this video if you have any questions make sure to leave them in the comments below and if you enjoyed the video make sure to like And subscribe for more videos on acquiring profitable businesses with little to zero down see you guys on the next one talk soon\",\"source_id\":\"2083\",\"similarity\":0.51995658636611,\"result_date\":\"2023-10-08T08:00:33.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=Z2-vsmOygPM\",\"source_category\":\"chunk\"},{\"content\":\" happen but I would be remiss if I didn't tell you that off Market is where you're most likely going to get the best deal doesn't mean you can't get a great deal on the on Market side but when you talk about off Market there's no broker involved it's just you and the owner now that usually means that you're going to get a better purchase price it usually that means that you'll be able to get some creative financing done when you're looking at a deal I'm a big fan of the off Market as you probably can tell although I've done deals on Market as well and there are good deals out there to be found that way now as I just mentioned on Market you're going to be finding it through a listing off Market you're going to have to reach out and get these owners where they are that's going to be through cold calling that's going to be through cold email it's going to be going through your own network and asking if anyone knows anyone interested in potentially selling their business it takes time it takes effort it's a numbers game but the payout will be better in the long run on average so at this point you found your off-market deal the seller's great he wants to sell an amazing business and you start doing your due diligence to make sure that this is a truly profitable cash flowing business that you want to add to your portfolio so now you are on your way to getting this thing under contract how do you do that now small businesses usually operate on a multiple basis based on the cash flow there are certain industries out there accounting being one of them where it's based on total revenue but for most of them it's going to be between 2 and 4x the cash flow that happens on a yearly basis and so when we're looking at negotiating a 2X business is one that's very relying upon the seller it's pretty much the seller doing all the work and if you were to buy it you are buying a job a Forex business is\",\"source_id\":\"2033\",\"similarity\":0.518960385384538,\"result_date\":\"2023-10-14T08:00:33.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=dIWuct9D73M\",\"source_category\":\"chunk\"},{\"content\":\"This video provides a comprehensive guide on how to invest in and buy a small business while keeping your current job. The speaker, an experienced business acquirer and mentor, debunks common objections such as lack of time, inexperience, fear of 'too good to be true' opportunities, and concerns about not being able to leave a job. He explains that with as little as 5–10 focused hours per week, mostly during the initial 6–9 month search process, it’s possible to find and acquire a profitable business. Key strategies include seeking businesses that have a competent general manager (GM) or someone who can be promoted to that role, ensuring the business is not owner-dependent for day-to-day operations, and that there are existing systems and documented processes. The ideal business has stable recurring revenue (at least two customer interactions per year), a management layer in place, and does not require highly specialized knowledge. Red flags to avoid include owner-dependent operations, lack of management hierarchy, unsustainable profit margins, and absence of documented systems. After acquisition, owners should focus on managing the manager, not day-to-day operations. Compensation for key managers often involves a base salary, bonus, and sometimes equity. Essential systems for success include financial reporting, customer acquisition, service delivery, and employee management. Regular (weekly) check-ins with the manager, clear KPIs, and not micromanaging are critical. Real-life student examples show people maintaining full-time jobs while owning businesses by following these principles. The speaker also offers a program, Acquisition Ace, for those seeking structured support in acquiring their first business while keeping their job.\",\"source_id\":\"59\",\"similarity\":0.516614137099492,\"result_date\":\"2025-04-28T17:01:54.045-07:00\",\"file_identifier\":\"https://docs.google.com/document/d/1h1HDGDs3oKayt52fArX7Kiqsg91mBnUj\",\"source_category\":\"summary\"},{\"content\":\" be in the space that you're already in outside of your friends and family let your colleagues know mentors alumni from your school anything that you can imagine in your terms of your broad Network tell them what you're doing tell them what you are looking for and I promise you you're going to start to get some referrals coming your way the next one is utilize online platforms there are several online marketplaces where businesses are listed for sale my favorite are Bisby sal.com and with kum.com both of these sites are the best when it comes to having updates regularly on bisb cell.com you're having Brokers list their their listings from all the across the United States and they have a pretty good user interface and then with with Kumo it's a paid service but it's only about $30 a month and you're able to aggregate all the searches from bis byell and the other hundred websites out there that have businesses and it takes them pulls them into one place so you can do a search and you can see everything that's across the internet for sale saves me a bunch of time I love using them they have a great team and a great product before we go too much further I'm actually going to show you exactly how I use these platforms to search for deals so here is Bisby cell.com and when you get to Bisby cell.com you have the front page right here we're going to click on our state that I currently live in and I'm going to choose service businesses as a way of what we're searching for click on that and the next thing I want you guys to focus on is the top bar where you have all of the different metrics you can choose I always go to more filters I always go to cash flow and I put a minimum of 500k because that's when I'm interested in my current deal size hit apply next thing I'm going to do is look at price I want to make sure I'm looking at businesses that have under a 4X price tag so \",\"source_id\":\"1738\",\"similarity\":0.514114529735717,\"result_date\":\"2023-10-29T09:00:00.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=0Ldo-nBbhEc\",\"source_category\":\"chunk\"},{\"content\":\" your debt payment so it is never coming out of your pocket it is coming out of the business's pocket now there are a bunch of different ways in order to get a deal done now one of the simplest methods that most of my students use is kind of the trifecta approach you're going to mix an SBA loan with seller financing and then bring either your own or even more preferable an investor to the deal to pay the down payment a typical deal may look like this 80% of the million doll deal which would be $800 000 is an SBA loan 10% will be seller financing that means at closing that 10% is not coming out of anyone's pocket that means after closing that $100 000 you now owe to the seller you'll start making payments on a payment plan towards the seller and that leaves the remaining 10% which is where you would bring in an investor with $100 000 to give towards the down payment to get the deal done now that is typically the most common way these types of deals get done but there's plenty of other students who've done 100% seller financing 90% seller financing there's other deals out there where they've bought into the business so they bought 50 or 75% of the business and the owner is still working the day-to-day still doing everything and the SBA still funds that type of acquisition so there's no excuse there's no limit to what you can do when you find a good deal there are dozens of ways in which you can structure it to get it across the Finish Line we talked about what is business acquisition now let's jump into how do you find these deals the most popular place that people like to get started and this is where I recommend you go just to get your feet wet is go to Bisby cell.com now bis byell is by volume the most visited site when it comes to business acquisition you go on there and these are typically deals in which there is a business broker\",\"source_id\":\"2066\",\"similarity\":0.513196841275598,\"result_date\":\"2024-09-28T12:45:39.000-07:00\",\"file_identifier\":\"https://www.youtube.com/watch?v=_RRODHfunuQ\",\"source_category\":\"chunk\"}]\""
    ],
    "estimatedTokens": 5873,
    "options": {
      "openai_api_key": {
        "lc": 1,
        "type": "secret",
        "id": [
          "OPENAI_API_KEY"
        ]
      },
      "model": "gpt-4.1",
      "temperature": 0.8,
      "timeout": 60000,
      "max_retries": 2,
      "configuration": {
        "baseURL": "https://api.openai.com/v1"
      },
      "model_kwargs": {}
    }
  }